dangernoodle-io/breadboard/examples/smoke/sdkconfig.defaults.esp32
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_FREERTOS_HZ=1000
# Stack overflow detection: PTRVAL canary prints the overflowing task name
# instead of aborting silently. Recommended alongside bb_health stack
# monitor. See CONFIG_BB_TASK_REGISTRY_BASE_POLL_MS in bb_task_registry Kconfig.
# Original ESP32 has no assist-debug module (SOC_ASSIST_DEBUG_SUPPORTED is
# unset), so CONFIG_ESP_SYSTEM_HW_STACK_GUARD isn't available here -- the
# end-of-stack hardware watchpoint below is the best deterministic (not
# sampled-at-context-switch) detection this chip offers.
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_PTRVAL=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_LOG_DEFAULT_LEVEL=3
# Enable bb_log panic coredump capture
CONFIG_BB_DIAG_PANIC_COREDUMP=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
CONFIG_BB_LOG_ROUTES=y
CONFIG_BB_OTA_PULL_AUTOREGISTER=y
# Enable RST-based SSE abort teardown (B1-517): bb_http_req_async_abort's
# SO_LINGER{on,0} setsockopt is inert without this — see bb_http.h.
CONFIG_LWIP_SO_LINGER=y
# Enable ESP-IDF httpd WebSocket support so bb_ws_server compiles its real
# (non-stub) implementation instead of the BB_ERR_UNSUPPORTED stubs used
# when this is unset.
CONFIG_HTTPD_WS_SUPPORT=y
# Required alongside CONFIG_HTTPD_WS_SUPPORT: bb_ws_server's
# ws_pre_handshake_cb gates the WS handshake against provisioning state
# (B1-1348); bb_ws_server.c #errors at build time if this is off while WS
# support is on.
CONFIG_HTTPD_WS_PRE_HANDSHAKE_CB_SUPPORT=y
# Enable uxTaskGetSystemState (used by bb_task_registry's periodic base-scan
# and GET /api/diag/tasks) so per-task stack high-water-mark reporting is
# non-stub in smoke builds. See bb_task_registry Kconfig and
# platform/espidf/bb_task_registry/bb_task_registry_base_scan.c. Smoke-only:
# examples/floor deliberately stays minimal (B1-1296).
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
